{
    "page": "lesson",
    "lessons": [
        {
            "title": "മുസ്ലിം ആവാനുള്ള അടിസ്ഥാനം",
            "desc": "",
            "active": true,
            "points": [
                {
                    "title": "ശഹാദത്ത് (വിശ്വാസ പ്രഖ്യാപനം)",
                    "desc": [
                        "ഇസ്‌ലാമിലേക്ക് പ്രവേശിക്കുന്നതിൻ്റെ ഏറ്റവും പ്രധാനപ്പെട്ടതും നിർബന്ധവുമായ അടിസ്ഥാനമാണിത്. ഇത് ഹൃദയം കൊണ്ട് വിശ്വസിച്ച് നാവുകൊണ്ട് പറയണം.",
                        "അശ്ഹദു അൻ ലാ ഇലാഹ ഇല്ലല്ലാഹ്, വ അശ്ഹദു അന്ന മുഹമ്മദൻ റസൂലുല്ലാഹ്.",
                        "<span class='text-muted small fst-italic'> അല്ലാഹുവല്ലാതെ ആരാധനക്കർഹനായി മറ്റാരുമില്ലെന്ന് ഞാൻ സാക്ഷ്യം വഹിക്കുന്നു, മുഹമ്മദ് (സ) അല്ലാഹുവിൻ്റെ ദൂതനാണെന്നും ഞാൻ സാക്ഷ്യം വഹിക്കുന്നു.</span>"
                    ],
                    "ref": [
                        {
                            "title": "ഇസ്‌ലാം കാര്യങ്ങൾ അഞ്ചാകുന്നു",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 8
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "തൗഹീദ്: ഏകദൈവ വിശ്വാസം",
                    "desc": [
                        "അല്ലാഹുവിനെ മാത്രം ആരാധിക്കുകയും അവനിൽ യാതൊന്നിനെയും പങ്കുചേർക്കാതിരിക്കുകയും ചെയ്യുക. നമസ്കാരം, പ്രാർത്ഥന, നേർച്ച എന്നിവയെല്ലാം അവനുവേണ്ടി മാത്രമായിരിക്കണം."
                    ],
                    "ref": [
                        {
                            "title": "പറയുക: അവൻ അല്ലാഹുവാണ്, ഏകനാണ്. അല്ലാഹു ഏവർക്കും ആശ്രയമായിട്ടുള്ളവനാണ്.",
                            "type": "quran",
                            "info": [
                                {
                                    "slug": 112,
                                    "number": 1
                                },
                                {
                                    "slug": 112,
                                    "number": 4
                                },
                                {
                                    "slug": 4,
                                    "number": 48
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "ശുദ്ധിയാകാനുള്ള കുളി (ഗുസ്ൽ)",
                    "desc": [
                        "ഇസ്‌ലാമിലേക്ക് പ്രവേശിക്കുമ്പോൾ ശരീരത്തെ പൂർണ്ണമായി ശുദ്ധീകരിക്കുന്നതിനായി കുളി നിർബന്ധമാണ്."
                    ],
                    "list": [
                        "വലിയ അശുദ്ധിയിൽ നിന്ന് ശുദ്ധിയാകാൻ കുളിക്കുന്നു എന്ന് ഹൃദയത്തിൽ നിയ്യത്ത് (ഉദ്ദേശ്യം) കരുതുക.",
                        "ശരീരം മുഴുവൻ വെള്ളം കൊണ്ട് കഴുകുക. (വായിലും മൂക്കിലും വെള്ളം എത്തിക്കണം)."
                    ],
                    "ref": [
                        {
                            "title": "ഖൈസ് ഇബ്ൻ ആസിം (റ) ഇസ്‌ലാം സ്വീകരിച്ചപ്പോൾ നബി ﷺ അദ്ദേഹത്തോട് വെള്ളവും ഇലകളും ഉപയോഗിച്ച് കുളിക്കാൻ കൽപ്പിച്ചു.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "abu-dawood",
                                    "number": 355
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "നമസ്കാരം (സ്വലാത്ത്)",
                    "desc": [
                        "ശഹാദത്തിന് ശേഷം ഒരു മുസ്ലിമിന് നിർബന്ധമായ പ്രധാനപ്പെട്ട ആരാധനയാണ് ദിവസവും അഞ്ച് നേരമുള്ള നമസ്കാരം. അത് വിശ്വാസിയെയും അവിശ്വാസിയെയും വേർതിരിക്കുന്ന അടയാളമാണ്."
                    ],
                    "ref": [
                        {
                            "title": "നമുക്കും അവർക്കുമിടയിലുള്ള ഉടമ്പടി നമസ്‌കാരമാണ്. ആരെങ്കിലും അത് ഉപേക്ഷിച്ചാൽ അവൻ അവിശ്വസിച്ചു.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "al-tirmidhi",
                                    "number": 2621
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
