{
    "page": "lesson",
    "lessons": [
        {
            "title": "ഉംറ: ഇഹ്റാമിൽ പ്രവേശിക്കൽ",
            "desc": "ഹജ്ജ് അല്ലെങ്കിൽ ഉംറ നിർവഹിക്കുന്നതിന് മുമ്പ് നിർബന്ധമായും പ്രവേശിക്കേണ്ട പ്രത്യേക ആത്മീയ അവസ്ഥയാണ് ഇഹ്റാം.",
            "active": true,
            "points": [
                {
                    "title": "നിയ്യത്തും (ഉദ്ദേശ്യം) മീഖാതും",
                    "desc": [
                        "മീഖാത്ത് (ഇഹ്റാം ചെയ്യേണ്ട അതിർത്തി) എത്തുന്നതിന് മുമ്പ് ശുദ്ധിയായ ശേഷം (കുളിക്കുകയോ വുളൂഅ് എടുക്കുകയോ ചെയ്യാം), മനസ്സിൽ ഉംറയ്ക്കുള്ള നിയ്യത്ത് (ഉദ്ദേശ്യം) കരുതുക. നിയ്യത്ത് ഹൃദയത്തിൽ മതിയാകും, വാക്കുകൊണ്ട് ഉച്ചരിക്കുന്നത് നിർബന്ധമില്ല.",
                        "മീഖാത്ത് കടക്കുന്നതിന് മുമ്പ് ഇഹ്റാം വസ്ത്രം ധരിക്കണം. അതിനുശേഷം 'ലബ്ബൈക്ക ഉംറത്തൻ' എന്ന് ചൊല്ലി തൽബിയത്ത് ആരംഭിക്കാം."
                    ],
                    "ref": [
                        {
                            "title": "നിങ്ങളുടെ പ്രവർത്തനങ്ങൾ ഉദ്ദേശങ്ങളെ ആശ്രയിച്ചിരിക്കുന്നു.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 1
                                }
                            ]
                        },
                        {
                            "title": "ഓരോ ദിശയിലുള്ളവർക്കും പ്രവാചകൻ ﷺ മീഖാത്തുകൾ നിശ്ചയിച്ചു നൽകി.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 1526
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "ഇഹ്റാം വസ്ത്രം (പുരുഷന്മാർക്ക്)",
                    "desc": [
                        "പുരുഷന്മാർ: തുന്നിച്ചേർത്ത വസ്ത്രങ്ങൾ ഒഴിവാക്കി, ഇസാർ (താഴെ ഉടുക്കുന്ന വസ്ത്രം), രിദാഅ് (മേൽവസ്ത്രം) എന്നിവ ധരിക്കുക. തല മറയ്ക്കുകയോ തുന്നിച്ചേർത്ത ഷൂസുകൾ ധരിക്കുകയോ ചെയ്യരുത്.",
                        "സ്ത്രീകൾ: സാധാരണ ശരീരം മറയ്ക്കുന്ന വസ്ത്രങ്ങൾ ധരിക്കാം. എന്നാൽ മുഖം മറയ്ക്കുന്ന നിഖാബ്, കൈയ്യുറകൾ എന്നിവ ഒഴിവാക്കണം."
                    ],
                    "ref": [
                        {
                            "title": "ഇഹ്റാമിലുള്ള പുരുഷൻ കുപ്പായം, തലപ്പാമ്പ്, തുന്നിച്ചേർത്ത തൊപ്പി, ഷൂസുകൾ എന്നിവ ധരിക്കരുത്.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 1542
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "കഅ്ബയിലെ ത്വവാഫ്",
            "desc": "ഇഹ്റാമിൽ പ്രവേശിച്ച ശേഷം മക്കയിൽ വെച്ച് ആദ്യം ചെയ്യേണ്ട കർമ്മമാണ് കഅ്ബയെ ഏഴ് തവണ പ്രദക്ഷിണം വെക്കൽ (ത്വവാഫ്).",
            "active": false,
            "points": [
                {
                    "title": "ത്വവാഫിന്റെ രൂപം",
                    "desc": [
                        "ഹജറുൽ അസ്വദ് (കറുത്ത കല്ല്) ഉള്ള കോർണറിൽ നിന്ന് ത്വവാഫ് ആരംഭിക്കുക. ഓരോ തവണ കല്ലിന് നേരെയെത്തുമ്പോഴും സാധിക്കുമെങ്കിൽ അതിനെ സ്പർശിക്കുകയോ ചുംബിക്കുകയോ ചെയ്യുക. അല്ലെങ്കിൽ കൈകൊണ്ട് ആംഗ്യം കാണിക്കുക.",
                        "തുടർച്ചയായി കഅ്ബയെ ഏഴ് തവണ ഇടത് ഭാഗത്തുകൂടി പ്രദക്ഷിണം ചെയ്യുക.",
                        "പുരുഷന്മാർ ആദ്യത്തെ മൂന്ന് ചുറ്റലുകൾ വേഗത്തിൽ നടക്കുകയും (റമൽ), വലതു തോൾ മറയ്ക്കാതെ ഇടത് തോൾ മാത്രം മൂടുകയും (ഇള്തിബാഅ്) ചെയ്യൽ സുന്നത്താണ്."
                    ],
                    "ref": [
                        {
                            "title": "കഅ്ബയെ ഞങ്ങൾ ജനങ്ങൾക്ക് ഒരു സമ്മേളന സ്ഥലവും അഭയ കേന്ദ്രവുമാക്കുകയും ചെയ്തു.",
                            "type": "quran",
                            "info": [
                                {
                                    "slug": 2,
                                    "number": 125
                                }
                            ]
                        },
                        {
                            "title": "പ്രവാചകൻ ﷺ മക്കയിൽ വന്നപ്പോൾ ഹജറുൽ അസ്വദിനെ ചുംബിക്കുകയും കഅ്ബയെ ഏഴ് തവണ പ്രദക്ഷിണം ചെയ്യുകയും ചെയ്തു.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 1613
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "ത്വവാഫിന് ശേഷമുള്ള കർമ്മങ്ങൾ",
                    "desc": [
                        "ത്വവാഫ് പൂർത്തിയാക്കിയ ശേഷം മഖാമു ഇബ്റാഹീമിന്റെ പിന്നിൽ (സാധിക്കുമെങ്കിൽ) നിന്നുകൊണ്ട് രണ്ട് റക്അത്ത് നമസ്കരിക്കുക. അതിനുശേഷം സംസം വെള്ളം കുടിക്കുന്നത് സുന്നത്താണ്."
                    ],
                    "ref": [
                        {
                            "title": "ഇബ്റാഹീം നിന്ന് നമസ്കരിച്ച സ്ഥലത്തെ നിങ്ങള്‍ നമസ്കാരവേദിയാക്കുക.",
                            "type": "quran",
                            "info": [
                                {
                                    "slug": 2,
                                    "number": 125
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "സഅ്‌യ്: സ്വഫാ-മർവ്വക്കിടയിൽ ഓടൽ",
            "desc": "ത്വവാഫിന് ശേഷം സ്വഫാ, മർവ്വ കുന്നുകൾക്കിടയിൽ ഏഴ് തവണ നടക്കുകയും ഓടുകയും ചെയ്യുന്ന കർമ്മമാണിത്.",
            "active": false,
            "points": [
                {
                    "title": "സഅ്‌യിന്റെ രൂപം",
                    "desc": [
                        "സ്വഫാ കുന്നിന് മുകളിൽ കയറി കഅ്ബയ്ക്ക് അഭിമുഖമായി നിന്ന് ദിക്റ് ചൊല്ലുകയും ദുആ ചെയ്യുകയും ചെയ്യുക.",
                        "സ്വഫായിൽ നിന്ന് മർവ്വയിലേക്ക് നടക്കുക. ഇത് ഒരു പൂർണ്ണമായ യാത്രയായി കണക്കാക്കും.",
                        "പുരുഷന്മാർ: സ്വഫായിൽ നിന്ന് മർവ്വയിലേക്കുള്ള യാത്രാമധ്യേ അടയാളപ്പെടുത്തിയ പച്ച ലൈറ്റുകൾക്ക് ഇടയിൽ ഓടുക (ഹർവല).",
                        "മർവ്വയിൽ എത്തിയാൽ സ്വഫായിൽ ചെയ്തതുപോലെ കഅ്ബയ്ക്ക് അഭിമുഖമായി നിന്ന് ദിക്റ് ചൊല്ലി ദുആ ചെയ്യുക.",
                        "മർവ്വയിൽ നിന്ന് സ്വഫായിലേക്ക് തിരിച്ചു നടക്കുക. ഇത് രണ്ടാമത്തെ യാത്രയായി കണക്കാക്കും. ഈ രീതിയിൽ ഏഴ് തവണ പൂർത്തിയാക്കുക (സ്വഫായിൽ നിന്ന് തുടങ്ങി മർവ്വയിൽ അവസാനിക്കണം)."
                    ],
                    "ref": [
                        {
                            "title": "തീര്‍ച്ചയായും സ്വഫായും മര്‍വയും അല്ലാഹുവിന്റെ ചിഹ്നങ്ങളിൽ പെട്ടതാകുന്നു.",
                            "type": "quran",
                            "info": [
                                {
                                    "slug": 2,
                                    "number": 158
                                }
                            ]
                        },
                        {
                            "title": "പ്രവാചകൻ ﷺ സ്വഫാ കുന്നിൻ മുകളിൽ നിന്ന് തുടങ്ങി മർവ്വയിൽ അവസാനിച്ചു.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-muslim",
                                    "number": 2950
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "തഹല്ലുൽ: ഇഹ്റാമിൽ നിന്ന് ഒഴിവാകൽ",
            "desc": "ഉംറയുടെ അവസാന കർമ്മമാണിത്. ഇതിലൂടെ ഇഹ്റാമിന്റെ നിരോധനങ്ങളിൽ നിന്ന് മുക്തനാകുന്നു.",
            "active": false,
            "points": [
                {
                    "title": "മുടി കളയുകയോ വെട്ടുകയോ ചെയ്യൽ",
                    "desc": [
                        "പുരുഷന്മാർ തല <b>മുഴുവൻ വടിക്കുകയാണ് (ഹൽഖ്)</b> ഏറ്റവും ഉത്തമം. അല്ലെങ്കിൽ മുടി <b>ചെറുതാക്കി വെട്ടുക (തഖ്സീർ)</b>. തല മുണ്ഡനം ചെയ്യുന്നവർക്ക് പ്രവാചകൻ ﷺ മൂന്ന് തവണ അനുഗ്രഹം തേടി.",
                        "സ്ത്രീകൾ: തലമുടി അറ്റത്തുനിന്ന് ഒരു വിരൽ തുമ്പോളം (അല്ലെങ്കിൽ അല്പം മാത്രം) വെട്ടുക."
                    ],
                    "ref": [
                        {
                            "title": "നിങ്ങൾ ശിരസ്സുകൾ മുണ്ഡനം ചെയ്തവരായിക്കൊണ്ടും, മുടി വെട്ടി ചെറുതാക്കിയവരായിക്കൊണ്ടും...",
                            "type": "quran",
                            "info": [
                                {
                                    "slug": 48,
                                    "number": 27
                                }
                            ]
                        },
                        {
                            "title": "അല്ലാഹുവേ, തല മുണ്ഡനം ചെയ്തവർക്ക് നീ അനുഗ്രഹം നൽകേണമേ!",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 1727
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
