{
    "page": "lesson",
    "lessons": [
        {
            "title": "പുണ്യം തേടിയുള്ള യാത്രകൾ",
            "desc": "നമസ്കാരത്തിനോ ആരാധനക്കോ പ്രത്യേക പ്രതിഫലം ലഭിക്കാൻ വേണ്ടി യാത്ര ചെയ്യാൻ അനുവാദമുള്ള മൂന്ന് പള്ളികളെക്കുറിച്ചുള്ള ഇസ്‌ലാമിക നിയമങ്ങളും അവയുടെ പ്രാധാന്യവുമാണ് ഇവിടെ വിശദീകരിക്കുന്നത്.",
            "active": true,
            "points": [
                {
                    "title": "നിയമം: പുണ്യം തേടി മൂന്ന് പള്ളികളിലേക്ക് മാത്രം",
                    "desc": [
                        "പ്രത്യേക പ്രതിഫലം മാത്രം ലക്ഷ്യമാക്കി യാത്ര ചെയ്യേണ്ടത് താഴെ പറയുന്ന മൂന്ന് പള്ളികളിലേക്ക് മാത്രമാണ്:",
                        "1. മസ്ജിദുൽ ഹറാം (മക്ക)",
                        "2. മസ്ജിദുന്നബവി (മദീന)",
                        "3. മസ്ജിദുൽ അഖ്സ (ഖുദ്‌സ്)"
                    ],
                    "ref": [
                        {
                            "title": "പുണ്യം തേടി മൂന്ന് പള്ളികളിലേക്കല്ലാതെ യാത്ര ചെയ്യേണ്ടതില്ല: മസ്ജിദുൽ ഹറാം, എന്റെ ഈ പള്ളി, മസ്ജിദുൽ അഖ്‌സ.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 1189
                                },
                                {
                                    "slug": "sahih-muslim",
                                    "number": 3384
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "ഈ പള്ളികളിലെ നമസ്കാരത്തിന്റെ ശ്രേഷ്ഠത",
                    "desc": [
                        "ഈ മൂന്ന് പള്ളികളിലെ നമസ്കാരങ്ങൾക്ക് മറ്റ് പള്ളികളേക്കാൾ (പ്രാദേശിക പള്ളികളേക്കാൾ) പ്രത്യേക പ്രതിഫലമുണ്ട്:"
                    ],
                    "ref": [
                        {
                            "title": "മസ്ജിദുൽ ഹറാമിലെ ഒരു നമസ്‌കാരം മറ്റെല്ലാ പള്ളികളിലെയും ഒരു ലക്ഷം നമസ്കാരത്തേക്കാൾ ശ്രേഷ്ഠമാണ്.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "ibn-e-majah",
                                    "number": 1406
                                }
                            ]
                        },
                        {
                            "title": "എൻ്റെ ഈ പള്ളിയിലെ (മസ്ജിദുന്നബവി) ഒരു നമസ്കാരം മറ്റുള്ളവയെക്കാൾ ആയിരം നമസ്കാരത്തേക്കാൾ ശ്രേഷ്ഠമാണ്. മസ്ജിദുൽ അഖ്സയിലെ നമസ്കാരം അഞ്ഞൂറ് നമസ്കാരത്തേക്കാൾ ശ്രേഷ്ഠമാണ്.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 1190
                                },
                                {
                                    "slug": "ibn-e-majah",
                                    "number": 1410
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "മറ്റു സ്ഥലങ്ങളിലേക്കുള്ള യാത്ര",
                    "desc": [
                        "ഈ മൂന്ന് പള്ളികളല്ലാത്ത മറ്റ് പള്ളികളിലേക്കോ സ്ഥലങ്ങളിലേക്കോ (ഉദാഹരണത്തിന്, ചരിത്രപരമായ പള്ളികൾ, മഖാമുകൾ) പ്രത്യേക 'പുണ്യം' പ്രതീക്ഷിച്ച് യാത്ര ചെയ്യുന്നത് ഈ ഹദീസിൻ്റെ അടിസ്ഥാനത്തിൽ വിലക്കപ്പെട്ടിരിക്കുന്നു.",
                        "എന്നാൽ, ജോലി, കുടുംബ സന്ദർശനം, ചികിത്സ, പഠനം, കച്ചവടം തുടങ്ങിയ ലോകപരമായ ആവശ്യങ്ങൾക്ക് യാത്ര ചെയ്യുന്നതിന് വിലക്കില്ല."
                    ],
                    "ref": [
                        {
                            "title": "നിങ്ങൾ എന്റെ ഖബർ പെരുന്നാൾ ദിനം ആക്കരുത്, നിങ്ങൾ എൻ്റെ പേരിൽ സ്വലാത്ത് ചൊല്ലുക; നിങ്ങളുടെ സ്വലാത്ത് നിങ്ങൾ എവിടെയായിരുന്നാലും എനിക്ക് എത്തിക്കപ്പെടും.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "abu-dawood",
                                    "number": 2042
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
