{
    "page": "lesson",
    "lessons": [
        {
            "title": "സുന്നത്ത് നോമ്പുകളും അനുബന്ധ വിഷയങ്ങളും",
            "desc": "",
            "active": true,
            "points": [
                {
                    "title": "ആഴ്ചയിലെ നോമ്പുകൾ (തിങ്കൾ, വ്യാഴം)",
                    "desc": [
                        "എല്ലാ ആഴ്ചയും തിങ്കൾ, വ്യാഴം ദിവസങ്ങളിൽ നോമ്പെടുക്കുന്നത് സുന്നത്താണ്. ഈ ദിവസങ്ങളിലാണ് അടിമകളുടെ കർമ്മങ്ങൾ അല്ലാഹുവിങ്കലേക്ക് ഉയർത്തപ്പെടുന്നത്."
                    ],
                    "ref": [
                        {
                            "title": "തിങ്കൾ, വ്യാഴം ദിവസങ്ങളിലാണ് കർമ്മങ്ങൾ (അല്ലാഹുവിങ്കലേക്ക്) ഉയർത്തപ്പെടുന്നത്. ഞാൻ നോമ്പുകാരനായിരിക്കെ എൻ്റെ കർമ്മങ്ങൾ ഉയർത്തപ്പെടാനാണ് ഞാൻ ആഗ്രഹിക്കുന്നത്.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "al-tirmidhi",
                                    "number": 747
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "മാസത്തിലെ മൂന്ന് നോമ്പുകൾ (അയ്യാമുൽ ബീദ്)",
                    "desc": [
                        "ഓരോ അറബി മാസത്തിലെയും 13, 14, 15 തിയതികളിൽ നോമ്പെടുക്കുന്നത് സുന്നത്താണ്. ഇത് വർഷം മുഴുവൻ നോമ്പെടുത്ത പ്രതിഫലം നൽകും."
                    ],
                    "ref": [
                        {
                            "title": "മാസത്തിൽ മൂന്ന് ദിവസങ്ങൾ നോമ്പെടുക്കുന്നത് വർഷം മുഴുവൻ നോമ്പെടുക്കുന്നതിന് തുല്യമാണ്.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 1979
                                },
                                {
                                    "slug": "sunan-nasai",
                                    "number": 2420
                                },
                                {
                                    "slug": "abu-dawood",
                                    "number": 2449,
                                    "sahih": false
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "അറഫാ ദിനത്തിലെ നോമ്പ് (ദുൽഹിജ്ജ 9)",
                    "desc": [
                        "ദുൽഹജ്ജ് മാസത്തിലെ ഒമ്പതാം ദിവസം (ഹജ്ജിൻ്റെ അറഫാ ദിനം) നോമ്പെടുക്കുന്നത് അതിശ്രേഷ്ഠമാണ്. ഇത് കഴിഞ്ഞുപോയ ഒരു വർഷത്തെയും വരാനിരിക്കുന്ന ഒരു വർഷത്തെയും പാപങ്ങൾ പൊറുപ്പിക്കാൻ കാരണമാകും."
                    ],
                    "ref": [
                        {
                            "title": "അറഫാ ദിനത്തിലെ നോമ്പിനെക്കുറിച്ച് നബി ﷺ യോട് ചോദിച്ചപ്പോൾ അവിടുന്ന് പറഞ്ഞു: അത് കഴിഞ്ഞുപോയ ഒരു വർഷത്തെയും വരാനിരിക്കുന്ന ഒരു വർഷത്തെയും പാപങ്ങൾ പൊറുപ്പിക്കും.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-muslim",
                                    "number": 2746
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "ആശൂറാഅ് നോമ്പ് (മുഹർറം 10)",
                    "desc": [
                        "മുഹർറം മാസത്തിലെ പത്താം ദിവസത്തെ നോമ്പ് കഴിഞ്ഞുപോയ ഒരു വർഷത്തെ പാപങ്ങൾ പൊറുപ്പിക്കാൻ കാരണമാകും. ഇതിനോടൊപ്പം ഒമ്പതാം ദിവസത്തെ നോമ്പെടുക്കുന്നത് സുന്നത്താണ് (ജൂതന്മാരിൽ നിന്ന് വേറിട്ട് നിൽക്കാൻ)."
                    ],
                    "ref": [
                        {
                            "title": "ആശൂറാഅ് നോമ്പിനെക്കുറിച്ച് നബി ﷺ യോട് ചോദിച്ചപ്പോൾ അവിടുന്ന് പറഞ്ഞു: അത് കഴിഞ്ഞുപോയ ഒരു വർഷത്തെ പാപങ്ങൾക്ക് പരിഹാരമാകും.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-muslim",
                                    "number": 2746
                                },
                                {
                                    "slug": "sahih-muslim",
                                    "number": 2666
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "ശവ്വാൽ മാസത്തിലെ ആറ് നോമ്പുകൾ",
                    "desc": [
                        "റമദാൻ നോമ്പിന് ശേഷം ശവ്വാൽ മാസത്തിൽ ആറ് നോമ്പുകൾ അനുഷ്ഠിക്കുന്നത് സുന്നത്താണ്. ഇത് വർഷം മുഴുവൻ നോമ്പെടുത്ത പ്രതിഫലം നേടിക്കൊടുക്കും."
                    ],
                    "ref": [
                        {
                            "title": "ആരെങ്കിലും റമദാൻ നോമ്പനുഷ്ഠിക്കുകയും ശേഷം ശവ്വാൽ മാസത്തിൽ ആറ് നോമ്പുകൾ എടുക്കുകയും ചെയ്താൽ അത് കാലം മുഴുവൻ നോമ്പെടുത്തത് പോലെയാണ്.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-muslim",
                                    "number": 2758
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "ദാവൂദ് നബിയുടെ നോമ്പ്",
                    "desc": [
                        "ദിവസം ഇടവിട്ട് നോമ്പെടുക്കുന്നത് ഏറ്റവും ശ്രേഷ്ഠമായ സുന്നത്ത് നോമ്പാണ്. ഇത് പ്രവാചകനായ ദാവൂദ് (അ)ൻ്റെ നോമ്പാണ്. ഇത് വർഷം മുഴുവൻ നോമ്പെടുക്കുന്നതിന് തുല്യമാണ്."
                    ],
                    "ref": [
                        {
                            "title": "നോമ്പുകളിൽ വെച്ച് അല്ലാഹുവിന് ഏറ്റവും ഇഷ്ടപ്പെട്ട നോമ്പ് ദാവൂദിൻ്റേതായിരുന്നു. അദ്ദേഹം ഒരു ദിവസം നോമ്പെടുക്കുകയും ഒരു ദിവസം നോമ്പ് ഉപേക്ഷിക്കുകയും ചെയ്യുമായിരുന്നു.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 3418
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "പത്തുദിവസങ്ങൾ (ദുൽഹിജ്ജ 1–9)",
                    "desc": [],
                    "ref": [
                        {
                            "title": "ദുൽഹിജ്ജ മാസത്തിലെ ആദ്യ 9 ദിവസങ്ങൾ നോമ്പ് വെയ്ക്കുന്നത് വളരെ പുണ്യമുള്ള പ്രവൃത്തി.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 969
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "ശഅ്‌ബാൻ മാസത്തിലെ നോമ്പുകൾ",
                    "desc": [],
                    "ref": [
                        {
                            "title": "നബി ﷺ പലപ്പോഴും ശഅ്‌ബാനിൽ ഏറെ നോമ്പ് വെയ്ക്കാറുണ്ടായിരുന്നു.",
                            "type": "hadith",
                            "info": [
                                {
                                    "slug": "sahih-bukhari",
                                    "number": 1970
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
